# LightingFixtureLightEmitter Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..LightingFixtureLightEmitter Property
ParameterTypeId Class See Also
---
"Light Emitter"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId LightingFixtureLightEmitter { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property LightingFixtureLightEmitter As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ LightingFixtureLightEmitter {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace